#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record.neon-lights: Refreshing state... [id=04615ff8cacc33d71c61f79cb192431a]
cloudflare_record.ecobee: Refreshing state... [id=4969712b5a12da9bb84fa577ac572ad2]
cloudflare_record.liam-room-starlights: Refreshing state... [id=af1285a4a5cc2502f9869f5022a21b76]
cloudflare_record.plaato-keg: Refreshing state... [id=5683789d262d7a39c6810fcdff4714d2]
cloudflare_record.driveway-switch: Refreshing state... [id=0348c3f3a76d8c5669f137d8e3a3afe2]
cloudflare_record.pergola-lights: Refreshing state... [id=609a242e2d642099cd9f5c96ac96b94e]
cloudflare_record.tubeszb-upstairs: Refreshing state... [id=75cbc477c66ed30eadcac5a918f334c0]
cloudflare_record.fallback_homelab: Refreshing state... [id=75f5144101a36185191fca84fc7796e5]
cloudflare_record.traeger: Refreshing state... [id=a77cc75f984feacc3b674a9add1f7f3a]
cloudflare_record.plaato-airlock: Refreshing state... [id=4c704c0c7cf279c364ee33963a3ee4bb]
cloudflare_record.garage-switch: Refreshing state... [id=002e6f3a662467025d4975621b480f3c]
cloudflare_record.plug2: Refreshing state... [id=9a1cc1673d9e09f8f1fde0c59c293659]
cloudflare_record.consul_fallback["192.168.3.2"]: Refreshing state... [id=536be979d94929b81d87a665715233b6]
cloudflare_record.ble-proxy: Refreshing state... [id=f3eacbf5511bc8d51ceff69e0df370bb]
cloudflare_record.front-porch-switch: Refreshing state... [id=f45b1a4cb7b62164612d0ab88cf8eb7a]
cloudflare_record.plug1: Refreshing state... [id=76c901e22aec826f496af1c371a15648]
cloudflare_record.liamplug: Refreshing state... [id=74d1a8c07affc3f1a86360a53c5666bb]
cloudflare_record.github_blog["185.199.108.153"]: Refreshing state... [id=f1ea179a3d83624da7b173b11a789a82]
cloudflare_record.github_blog["185.199.109.153"]: Refreshing state... [id=99df50d78ec7f08bc3d2c53bacffd61c]
cloudflare_record.github_blog["185.199.110.153"]: Refreshing state... [id=0db147f094531c10a68fb8de8cdb7ac8]
cloudflare_record.github_blog["185.199.111.153"]: Refreshing state... [id=9467764f51c986edac8cd003f12b82c1]
cloudflare_record.unicorn: Refreshing state... [id=cfe6b980ab81640223fddcd66339e6c0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.neon-lights must be replaced
-/+ resource "cloudflare_record" "neon-lights" {
      ~ created_on      = "2024-04-06T17:09:25.24884Z" -> (known after apply)
      ~ hostname        = "neon-lights.iot.marcyoung.us" -> (known after apply)
      ~ id              = "04615ff8cacc33d71c61f79cb192431a" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
      ~ modified_on     = "2024-04-06T17:09:25.24884Z" -> (known after apply)
      ~ name            = "neon-lights.iot.marcyoung.us" -> "unicorn.iot.marcyoung.us" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Create terraform plan`*